# TwoLineRiseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystemType..::..TwoLineRiseType Property
PipingSystemType Class See Also
---
Symbol for a 2 line rise
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RiseDropSymbol TwoLineRiseType { get; set; }
```

Visual Basic
---
```text
Public Property TwoLineRiseType As RiseDropSymbol
	Get
	Set
```

Visual C++
---
```text
public:
property RiseDropSymbol TwoLineRiseType {
	RiseDropSymbol get ();
	void set (RiseDropSymbol value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input is not a valid piping rise/drop symbol type. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace